{"data":{"markdownRemark":{"html":"<p>Hey! Welcome to the front page of me.</p>\n<p>For my new year resolution, I wanna start writing more to improve ways to express myself. For some reason I always struggle with writing, whether its for assignment or work. Its just that went I start writing, its a struggle to express the message I want to convey. Another reason is that that writing helps memory retaining learning outcome and be able to reflect on life. I usually live at the moment but as I get older, the need to have the ability to look back more consciously becomes more apparent. Actually, it was planned to me released this blog post on December or before the new years, everything on the website is done except the content. I slack on writing it because it feels hard to write out a post with a high quality styles that I always see elsewhere. A post that was a concise message and flow. But I guess everyone has to start somewhere. As time pass by, I wanna improve my methods to write out quality pieces. Stuff like pre-planning the flow, writing down topics and etc. Years of University Assignment writing only slightly improve my flow, I think it's because those are more focus on established subjects that I can based it on while here its more personal and that aspect of writing I have to adopt into my posts.</p>\n<p>So I decided to start a blog. I'm gonna commit to release a post once a month, maybe push it to a biweekly basis. I'm gonna write about reviews about shows, interesting technology and maybe opinionated stuff. For tech related post, its gonna be cross post to my medium article. At the same time, I'm got some features planned for my website like a comment system, recommendations, search functionality, feedback, general UI improvements and also include more side projects as well as improving the website design. I read somewhere that the optimal length of a post should be around 2100 words or 8 minutes<sup><a href=\"https://medium.com/data-lab/the-optimal-post-is-7-minutes-74b9f41509b\">1</a></sup> of reading time. That is quite the length and I also realize that's probably the length of the script for most videos made on Youtube. Makes you wonder on time it thought to finish the script of a video. At the moment of writing the script, I'm struggling to chunk out 600 word even. So I have decide that 600+ should be the target I'll try to reach first. Maybe I'll progressively increase the content I can write in a single post.</p>\n<p>Currently due to architecture of the website, there is no more back-end for the website. But I wanna hear feedback on my post and such. So as a temporary solution. I setup Formspree, so email contact form solution. By submitting the form below, I will get an email about your post. It is not a good solution if likes say I got hundred of comment(a man can dream) and there is no native way to do sorting. There's also the tedious task of approving every post's feedback form. A possible solution is I setup a serverless function API to handle submitting comments and to load the comments from S3 maybe. But that is a problem for another day.</p>\n<p>There's already a few post ideas I had in mind already. Gonna write about the tech stacks I used for building this website and about my other interest like machine learning and my journey with Udacity's Pytorch challenge. Lastly,  I hope you enjoyed reading about a guy babbling about his quarter life crisis, Happy New year to the readers. </p>\n<p>*601 words</p>","frontmatter":{"path":"/blog/My-first-post","title":"I just started this website","date":"02 January 2019"},"excerpt":"Hey! Welcome to the front page of me. For my new year resolution, I wanna start writing more to improve ways to express myself. For some reason I always struggle with writing, whether its for…"}},"pageContext":{"pathSlug":"/blog/My-first-post"}}